# ExternalResourceSubFolder Properties

---
The ExternalResourceSubFolder type exposes the following members.
| Name| Description
---|---|---
| FolderName|  Folder displayed name.
| IconPath|  The path of the resource icon.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
ExternalResourceSubFolder Class
Autodesk.Revit.DB Namespace